In [2]:
import pandas as pd
import numpy as np

Q1. Write a Pandas program to set t_id column as an Index in a given dataframe.

In [3]:
df1 = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'],
    't_id':['t1', 't2', 't3', 't4', 't5', 't6']})
df1

  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6

In [4]:
df1.set_index('t_id',drop=True)

     school_code class            name date_Of_Birth  weight  address
t_id
t1          s001     V  Alberto Franco    15/05/2002      35  street1
t2          s002     V    Gino Mcneill    17/05/2002      32  street2
t3          s003    VI     Ryan Parkes    16/02/1999      33  street3
t4          s001    VI    Eesha Hinton    25/09/1998      30  street1
t5          s002     V    Gino Mcneill    11/05/2002      31  street2
t6          s004    VI    David Parkes    15/09/1997      32  street4

Q2. Write a Pandas program to create a multi Index dataframe using two columns t_id, school_code.

In [5]:
df1.set_index(['t_id','school_code'],drop=True)

                 class            name date_Of_Birth  weight  address
t_id school_code
t1   s001            V  Alberto Franco    15/05/2002      35  street1
t2   s002            V    Gino Mcneill    17/05/2002      32  street2
t3   s003           VI     Ryan Parkes    16/02/1999      33  street3
t4   s001           VI    Eesha Hinton    25/09/1998      30  street1
t5   s002            V    Gino Mcneill    11/05/2002      31  street2
t6   s004           VI    David Parkes    15/09/1997      32  street4

 Q3. Write a Pandas program to 

  a. set a column 't_id' as an Index in a given dataframe without dropping from column

  b. reset the index 't_id' to integer index without adding 't_id' as a repeated column.

In [6]:
df1.set_index('t_id',inplace=True, drop=False)
df1

     school_code class            name date_Of_Birth  weight  address t_id
t_id
t1          s001     V  Alberto Franco    15/05/2002      35  street1   t1
t2          s002     V    Gino Mcneill    17/05/2002      32  street2   t2
t3          s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
t4          s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
t5          s002     V    Gino Mcneill    11/05/2002      31  street2   t5
t6          s004    VI    David Parkes    15/09/1997      32  street4   t6

In [7]:
df1.reset_index(drop=True, inplace=True)
df1

  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6

Q4. Write a Pandas program to create an index labels index=[1, 2, 3, 4, 5, 6] by 

  a. using 64-bit integers, 
  
  b. using floating-point numbers in a above dataframe.

In [8]:
# Sol-1 by assigning name to index
df1['index']=[1, 2, 3, 4, 5, 6]
df1.set_index('index')

#** df.set_index - is for setting index name
#** df.index - is for setting index values
#** df.index.name - is for setting index name

      school_code class            name date_Of_Birth  weight  address t_id
index
1            s001     V  Alberto Franco    15/05/2002      35  street1   t1
2            s002     V    Gino Mcneill    17/05/2002      32  street2   t2
3            s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
4            s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
5            s002     V    Gino Mcneill    11/05/2002      31  street2   t5
6            s004    VI    David Parkes    15/09/1997      32  street4   t6

In [9]:
# Sol-2 without assigning name to index
df1.index=[1, 2, 3, 4, 5, 6]
df1

  school_code class            name date_Of_Birth  weight  address t_id  index
1        s001     V  Alberto Franco    15/05/2002      35  street1   t1      1
2        s002     V    Gino Mcneill    17/05/2002      32  street2   t2      2
3        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3      3
4        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4      4
5        s002     V    Gino Mcneill    11/05/2002      31  street2   t5      5
6        s004    VI    David Parkes    15/09/1997      32  street4   t6      6

In [10]:
df1.index=[.1, .2, .3, .4, .5, .6]
df1

,school_code,class,name,date_Of_Birth,weight,address,t_id,index
0.1,s001,V,Alberto Franco,15/05/2002,35,street1,t1,1
0.2,s002,V,Gino Mcneill,17/05/2002,32,street2,t2,2
0.3,s003,VI,Ryan Parkes,16/02/1999,33,street3,t3,3
0.4,s001,VI,Eesha Hinton,25/09/1998,30,street1,t4,4
0.5,s002,V,Gino Mcneill,11/05/2002,31,street2,t5,5
0.6,s004,VI,David Parkes,15/09/1997,32,street4,t6,6

Q5. Write a Pandas program to create a DataFrame using intervals as an index.

IntervalIndex represents an Index of Interval objects that are all closed on the same side.

pandas.IntervalIndex.from_breaks: Construct an IntervalIndex from an array of splits

pandas.IntervalIndex.from_tuples: Construct an IntervalIndex from a list/array of tuples

pandas.IntervalIndex.from_arrays: Construct from two arrays defining the left and right bounds.

In [11]:
# Create an Interval Index using IntervalIndex.from_breaks:
x=[1, 2, 3, 4, 5, 6, 7] # as column
l=[0, 0.5, 1.0, 1.5, 2.0, 2.5, 3, 3.5] # list to make a intervelindex
t=[(0, .5), (.5, 1), (1, 1.5), (1.5, 2), (2, 2.5), (2.5, 3), (3, 3.5)] # Tupples to make a intervelindex
a, b = np.array([0, .5, 1, 1.5, 2, 2.5, 3]), np.array([.5, 1, 1.5, 2, 2.5, 3, 3.5]) # array to make a intervelindex
df_interval = pd.DataFrame({"X":x}, index = pd.IntervalIndex.from_breaks(l))
df_interval

            X
(0.0, 0.5]  1
(0.5, 1.0]  2
(1.0, 1.5]  3
(1.5, 2.0]  4
(2.0, 2.5]  5
(2.5, 3.0]  6
(3.0, 3.5]  7

In [12]:
df_interval.index

IntervalIndex([(0.0, 0.5], (0.5, 1.0], (1.0, 1.5], (1.5, 2.0], (2.0, 2.5], (2.5, 3.0], (3.0, 3.5]],
              closed='right',
              dtype='interval[float64]')

In [13]:
# Create an Interval Index using IntervalIndex.from_tuples:
df_interval = pd.DataFrame({"X":x}, index = pd.IntervalIndex.from_tuples(t))
df_interval

            X
(0.0, 0.5]  1
(0.5, 1.0]  2
(1.0, 1.5]  3
(1.5, 2.0]  4
(2.0, 2.5]  5
(2.5, 3.0]  6
(3.0, 3.5]  7

In [14]:
# Create an Interval Index using IntervalIndex.from_arrays:
df_interval = pd.DataFrame({"X":x},index = pd.IntervalIndex.from_arrays(a,b))
df_interval

            X
(0.0, 0.5]  1
(0.5, 1.0]  2
(1.0, 1.5]  3
(1.5, 2.0]  4
(2.0, 2.5]  5
(2.5, 3.0]  6
(3.0, 3.5]  7

Q6. Write a Pandas program to create a dataframe with sale_amt as column and a datetime index of ten values by .

In [15]:
Sale_amt=[100, 110, 117, 150, 112, 99, 129, 135, 140, 150]
dt_range = pd.date_range(start ='2020-05-12 07:10:10', freq ='S', periods = 10)
dt_range

DatetimeIndex(['2020-05-12 07:10:10', '2020-05-12 07:10:11',
               '2020-05-12 07:10:12', '2020-05-12 07:10:13',
               '2020-05-12 07:10:14', '2020-05-12 07:10:15',
               '2020-05-12 07:10:16', '2020-05-12 07:10:17',
               '2020-05-12 07:10:18', '2020-05-12 07:10:19'],
              dtype='datetime64[ns]', freq='S')

In [16]:
dt_df=pd.DataFrame({"Sale_amt":[100, 110, 117, 150, 112, 99, 129, 135, 140, 150]},index = dt_range)
dt_df

                     Sale_amt
2020-05-12 07:10:10       100
2020-05-12 07:10:11       110
2020-05-12 07:10:12       117
2020-05-12 07:10:13       150
2020-05-12 07:10:14       112
2020-05-12 07:10:15        99
2020-05-12 07:10:16       129
2020-05-12 07:10:17       135
2020-05-12 07:10:18       140
2020-05-12 07:10:19       150

Q7. Write a Pandas program to set a name of index to Index_name in the above df

In [17]:
dt_df.index.name='Index_name'
dt_df

                     Sale_amt
Index_name
2020-05-12 07:10:10       100
2020-05-12 07:10:11       110
2020-05-12 07:10:12       117
2020-05-12 07:10:13       150
2020-05-12 07:10:14       112
2020-05-12 07:10:15        99
2020-05-12 07:10:16       129
2020-05-12 07:10:17       135
2020-05-12 07:10:18       140
2020-05-12 07:10:19       150

Q8. Write a Pandas program to set value in a specific cell in a given dataframe using index.

Replace the values of school_code and date_of_birth in t6 row to s005 and 16/05/2002 in the above dataframe

In [18]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32]},
     index = ['t1', 't2', 't3', 't4', 't5', 't6'])
df

   school_code class            name date_of_birth  weight
t1        s001     V  Alberto Franco    15/05/2002      35
t2        s002     V    Gino Mcneill    17/05/2002      32
t3        s003    VI     Ryan Parkes    16/02/1999      33
t4        s001    VI    Eesha Hinton    25/09/1998      30
t5        s002     V    Gino Mcneill    11/05/2002      31
t6        s004    VI    David Parkes    15/09/1997      32

In [19]:
# Sol-1
df.at['t6', 'school_code'] = 's005'   # at - Access a single value for a row/column label pair.
df.at['t6', 'date_of_birth'] = '16/05/2002' 
df

   school_code class            name date_of_birth  weight
t1        s001     V  Alberto Franco    15/05/2002      35
t2        s002     V    Gino Mcneill    17/05/2002      32
t3        s003    VI     Ryan Parkes    16/02/1999      33
t4        s001    VI    Eesha Hinton    25/09/1998      30
t5        s002     V    Gino Mcneill    11/05/2002      31
t6        s005    VI    David Parkes    16/05/2002      32

In [20]:
# Sol-2
df.loc['t6', 'school_code'] = 's005'
df

   school_code class            name date_of_birth  weight
t1        s001     V  Alberto Franco    15/05/2002      35
t2        s002     V    Gino Mcneill    17/05/2002      32
t3        s003    VI     Ryan Parkes    16/02/1999      33
t4        s001    VI    Eesha Hinton    25/09/1998      30
t5        s002     V    Gino Mcneill    11/05/2002      31
t6        s005    VI    David Parkes    16/05/2002      32

Q9. Write a Pandas program to convert index of a above dataframe into a column.

In [21]:
# ** Eventhough drop default is false, it is changing to True when used with inplace=True
df.reset_index(level=0, inplace=True, drop=False) 
df

  index school_code class            name date_of_birth  weight
0    t1        s001     V  Alberto Franco    15/05/2002      35
1    t2        s002     V    Gino Mcneill    17/05/2002      32
2    t3        s003    VI     Ryan Parkes    16/02/1999      33
3    t4        s001    VI    Eesha Hinton    25/09/1998      30
4    t5        s002     V    Gino Mcneill    11/05/2002      31
5    t6        s005    VI    David Parkes    16/05/2002      32

Q10. Write a Pandas program 

a. to set a multilevel index of t_id, school_code, class to the given dataframe and then

b. convert 1st and 3rd levels in the index into columns from a multiple level of index frame.

In [22]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    't_id': ['t1', 't2', 't3', 't4', 't5', 't6']})
df

  school_code class            name date_of_birth  weight t_id
0        s001     V  Alberto Franco    15/05/2002      35   t1
1        s002     V    Gino Mcneill    17/05/2002      32   t2
2        s003    VI     Ryan Parkes    16/02/1999      33   t3
3        s001    VI    Eesha Hinton    25/09/1998      30   t4
4        s002     V    Gino Mcneill    11/05/2002      31   t5
5        s004    VI    David Parkes    15/09/1997      32   t6

In [23]:
df1=df.set_index(['t_id', 'school_code', 'class'])

In [24]:
df1.reset_index(level=['t_id', 'class']) 
# ** set & reset index can be done on multi index by passing a list.

            t_id class            name date_of_birth  weight
school_code
s001          t1     V  Alberto Franco    15/05/2002      35
s002          t2     V    Gino Mcneill    17/05/2002      32
s003          t3    VI     Ryan Parkes    16/02/1999      33
s001          t4    VI    Eesha Hinton    25/09/1998      30
s002          t5     V    Gino Mcneill    11/05/2002      31
s004          t6    VI    David Parkes    15/09/1997      32

Q11.1 Write a Pandas program to check if a specified value t1, t11 exists in single column index dataframe.

In [25]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32]},
     index =  ['t1', 't2', 't3', 't4', 't5', 't6'])
df

   school_code class            name date_of_birth  weight
t1        s001     V  Alberto Franco    15/05/2002      35
t2        s002     V    Gino Mcneill    17/05/2002      32
t3        s003    VI     Ryan Parkes    16/02/1999      33
t4        s001    VI    Eesha Hinton    25/09/1998      30
t5        s002     V    Gino Mcneill    11/05/2002      31
t6        s004    VI    David Parkes    15/09/1997      32

In [26]:
't1' in df.index

True

In [27]:
't11' in df.index

False

Q11.2 Write a Pandas program to check if a specified value t4 exists in multiple column index dataframe.

In [28]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    't_id': ['t1', 't2', 't3', 't4', 't5', 't6']})
df1 = df.set_index(['t_id', 'school_code', 'class'])
df1

                                  name date_of_birth  weight
t_id school_code class
t1   s001        V      Alberto Franco    15/05/2002      35
t2   s002        V        Gino Mcneill    17/05/2002      32
t3   s003        VI        Ryan Parkes    16/02/1999      33
t4   s001        VI       Eesha Hinton    25/09/1998      30
t5   s002        V        Gino Mcneill    11/05/2002      31
t6   s004        VI       David Parkes    15/09/1997      32

In [29]:
print('t4' in df1.index) # checking in all levels of index

# checking in at each level
print('t4' in df1.index.levels[0])
print('t4' in df1.index.levels[1])
print('t4' in df1.index.levels[2])

True
True
False
False

Q12. Write a Pandas program to construct a series of 8 values using random numpy array and set MultiIndex levels as the column and index using sales_arrays.

Sample Output:

    sale   city 
    sale1  city1   -1.533805
          city2   -1.546815
    sale2  city1    0.018307
          city2   -0.210834
    sale3  city1    0.903430
          city2    1.269479
    sale4  city1   -0.550486
          city2    1.738659

In [30]:
sales_arrays = [['sale1', 'sale1', 'sale2', 'sale2', 'sale3', 'sale3', 'sale4', 'sale4'],
          ['city1', 'city2', 'city1', 'city2', 'city1', 'city2', 'city1', 'city2']]

sales_tuples = list(zip(*sales_arrays))
sales_index = pd.MultiIndex.from_tuples(sales_tuples, names=['sale', 'city'])
s = pd.Series(np.random.randn(8), index = sales_index)
s

sale   city
sale1  city1   -1.774021
       city2    0.683579
sale2  city1    0.496914
       city2    2.275370
sale3  city1   -1.024598
       city2   -1.246518
sale4  city1    1.422862
       city2    0.213137
dtype: float64

Q13. Write a Pandas program to construct a DataFrame using random numpy array and set MultiIndex levels as the column and index.

Sample Output:

                        0         1         2         3         4
    sale  city                                                   
    sale1 city1 -1.020550 -0.809408  0.911425  0.059023  0.495317
          city2 -1.208514  0.039022  0.088428 -0.899280  1.722276
    sale2 city1  0.510427 -0.396097 -2.076445  1.080586  1.268495
          city2 -1.158077 -0.892657  1.221519 -0.802645  0.095342
    sale3 city1  1.535934  0.432627 -1.307655  0.031096 -0.060850
          city2  0.601156  0.202661 -1.469705 -1.787885  1.285210
    sale4 city1  0.455104  0.395752  0.115163  1.188649  0.415450
          city2  0.218054 -0.722397  0.590288 -1.347249 -0.223215

In [31]:
sales_arrays = [['sale1', 'sale1', 'sale2', 'sale2', 'sale3', 'sale3', 'sale4', 'sale4'],
          ['city1', 'city2', 'city1', 'city2', 'city1', 'city2', 'city1', 'city2']]

sales_tuples = list(zip(*sales_arrays))
sales_index = pd.MultiIndex.from_tuples(sales_tuples, names=['sale', 'city'])
df = pd.DataFrame(np.random.randn(8, 5), index=sales_index)
df

                    0         1         2         3         4
sale  city
sale1 city1  0.255030  0.607809  1.690995 -0.771513  0.931271
      city2  0.376048 -1.116930 -0.461052  0.963418  0.869431
sale2 city1  0.716944 -0.867346 -0.224485 -2.645468  0.318142
      city2 -0.109140  0.554530 -0.550075 -0.857442 -1.166355
sale3 city1  0.174734  1.232789  0.419472  1.005888 -0.791649
      city2  2.393727 -0.236061 -2.510629  1.317343  1.032973
sale4 city1  0.237944  1.176823  0.104505  2.909946 -0.333183
      city2 -0.740141  1.639670 -0.444269  0.675520  0.619749

Q14. Write a Pandas program to extract 

  a. a single row of index (sale2, city2) 

  b. rows in sale1 index

  c. a specific value from a MultiIndex levels where row is ('sale1', 'city2') and column is 1 from above DataFrame.

In [32]:
# Sol-1 - Extract a single row of index (sale2, city2)
df.loc[('sale2', 'city2')]  #** multi index as pass as tuple while slicing DF

0   -0.109140
1    0.554530
2   -0.550075
3   -0.857442
4   -1.166355
Name: (sale2, city2), dtype: float64

In [33]:
# Sol-2 - Extract a single row of index (sale2, city2)
df.iloc[3]   #** while using with iloc row index is not tuple. its same as range index in normal DF

0   -0.109140
1    0.554530
2   -0.550075
3   -0.857442
4   -1.166355
Name: (sale2, city2), dtype: float64

In [34]:
# Sol-1 # Extract rows in sale1 index - leve0
df.loc['sale1']

              0         1         2         3         4
city
city1  0.255030  0.607809  1.690995 -0.771513  0.931271
city2  0.376048 -1.116930 -0.461052  0.963418  0.869431

In [35]:
# Sol-2 # Extract rows in sale1 index
df.iloc[[0,1]]

                    0         1         2         3         4
sale  city
sale1 city1  0.255030  0.607809  1.690995 -0.771513  0.931271
      city2  0.376048 -1.116930 -0.461052  0.963418  0.869431

In [36]:
# Extract a single value where row is ('sale1', 'city2') and column is 1
df.loc[('sale1', 'city2'), 1]

-1.1169300665251023

Q15. Write a Pandas program to 

  a. rename names of columns to col1 to col5 and 
  
  b. specific labels of the row Index from [sale2, city2] to [S2, C2"] in the above dataframe

In [37]:
df

                    0         1         2         3         4
sale  city
sale1 city1  0.255030  0.607809  1.690995 -0.771513  0.931271
      city2  0.376048 -1.116930 -0.461052  0.963418  0.869431
sale2 city1  0.716944 -0.867346 -0.224485 -2.645468  0.318142
      city2 -0.109140  0.554530 -0.550075 -0.857442 -1.166355
sale3 city1  0.174734  1.232789  0.419472  1.005888 -0.791649
      city2  2.393727 -0.236061 -2.510629  1.317343  1.032973
sale4 city1  0.237944  1.176823  0.104505  2.909946 -0.333183
      city2 -0.740141  1.639670 -0.444269  0.675520  0.619749

In [38]:
# Renaming the column names
df.rename(columns={0: "col1", 1: "col2", 2:"col3", 3:"col4", 4:"col5"})

                 col1      col2      col3      col4      col5
sale  city
sale1 city1  0.255030  0.607809  1.690995 -0.771513  0.931271
      city2  0.376048 -1.116930 -0.461052  0.963418  0.869431
sale2 city1  0.716944 -0.867346 -0.224485 -2.645468  0.318142
      city2 -0.109140  0.554530 -0.550075 -0.857442 -1.166355
sale3 city1  0.174734  1.232789  0.419472  1.005888 -0.791649
      city2  2.393727 -0.236061 -2.510629  1.317343  1.032973
sale4 city1  0.237944  1.176823  0.104505  2.909946 -0.333183
      city2 -0.740141  1.639670 -0.444269  0.675520  0.619749

In [39]:
# Renaming row [sale2, city2] to [S2, C2"]
df.rename(index={"sale2": "S2", "city2": "C2"})

                    0         1         2         3         4
sale  city
sale1 city1  0.255030  0.607809  1.690995 -0.771513  0.931271
      C2     0.376048 -1.116930 -0.461052  0.963418  0.869431
S2    city1  0.716944 -0.867346 -0.224485 -2.645468  0.318142
      C2    -0.109140  0.554530 -0.550075 -0.857442 -1.166355
sale3 city1  0.174734  1.232789  0.419472  1.005888 -0.791649
      C2     2.393727 -0.236061 -2.510629  1.317343  1.032973
sale4 city1  0.237944  1.176823  0.104505  2.909946 -0.333183
      C2    -0.740141  1.639670 -0.444269  0.675520  0.619749

Q16. Write a Pandas program 

  a. to sort a MultiIndex of a DataFrame. 
  
  b. to sort on level-0 of index in the above dataframe.

In [40]:
# to sort a MultiIndex of a DataFrame
df.sort_index()

                    0         1         2         3         4
sale  city
sale1 city1  0.255030  0.607809  1.690995 -0.771513  0.931271
      city2  0.376048 -1.116930 -0.461052  0.963418  0.869431
sale2 city1  0.716944 -0.867346 -0.224485 -2.645468  0.318142
      city2 -0.109140  0.554530 -0.550075 -0.857442 -1.166355
sale3 city1  0.174734  1.232789  0.419472  1.005888 -0.791649
      city2  2.393727 -0.236061 -2.510629  1.317343  1.032973
sale4 city1  0.237944  1.176823  0.104505  2.909946 -0.333183
      city2 -0.740141  1.639670 -0.444269  0.675520  0.619749

In [41]:
# Sol-1 Sort on Index level=0
df.sort_index(level=0)

                    0         1         2         3         4
sale  city
sale1 city1  0.255030  0.607809  1.690995 -0.771513  0.931271
      city2  0.376048 -1.116930 -0.461052  0.963418  0.869431
sale2 city1  0.716944 -0.867346 -0.224485 -2.645468  0.318142
      city2 -0.109140  0.554530 -0.550075 -0.857442 -1.166355
sale3 city1  0.174734  1.232789  0.419472  1.005888 -0.791649
      city2  2.393727 -0.236061 -2.510629  1.317343  1.032973
sale4 city1  0.237944  1.176823  0.104505  2.909946 -0.333183
      city2 -0.740141  1.639670 -0.444269  0.675520  0.619749

In [42]:
# Sol-2 Sort on Index level=0
# Pass a level name to sort the DataFrame
df.sort_index(level="sale")

                    0         1         2         3         4
sale  city
sale1 city1  0.255030  0.607809  1.690995 -0.771513  0.931271
      city2  0.376048 -1.116930 -0.461052  0.963418  0.869431
sale2 city1  0.716944 -0.867346 -0.224485 -2.645468  0.318142
      city2 -0.109140  0.554530 -0.550075 -0.857442 -1.166355
sale3 city1  0.174734  1.232789  0.419472  1.005888 -0.791649
      city2  2.393727 -0.236061 -2.510629  1.317343  1.032973
sale4 city1  0.237944  1.176823  0.104505  2.909946 -0.333183
      city2 -0.740141  1.639670 -0.444269  0.675520  0.619749

Q17. Write a Pandas program 

  a. to extract elements in the given positional row indices. 
  positions = [1, 2, 4]

  b. to extract elements in the given positional column indices [1, 2, 4]
  
  c. extract elements in the given positional column indices [1, 2, 4] and reverse the order of the columns to [4,2,1]

In [43]:
# extract elements in the given positional row indices
positions = [1, 2, 4]
df.take([1, 2, 4])

                    0         1         2         3         4
sale  city
sale1 city2  0.376048 -1.116930 -0.461052  0.963418  0.869431
sale2 city1  0.716944 -0.867346 -0.224485 -2.645468  0.318142
sale3 city1  0.174734  1.232789  0.419472  1.005888 -0.791649

In [44]:
# extract elements in the given positional column indices
df.take([1, 2, 4], axis=1) 
# take - Return the elements in the given *positional* indices along an axis.

                    1         2         4
sale  city
sale1 city1  0.607809  1.690995  0.931271
      city2 -1.116930 -0.461052  0.869431
sale2 city1 -0.867346 -0.224485  0.318142
      city2  0.554530 -0.550075 -1.166355
sale3 city1  1.232789  0.419472 -0.791649
      city2 -0.236061 -2.510629  1.032973
sale4 city1  1.176823  0.104505 -0.333183
      city2  1.639670 -0.444269  0.619749

In [45]:
# extract elements in the given positional column indices and reverse the order of the columns to [4,2,1]
#sol-1
print(df.take([-1, -3, -4], axis=1))
#** diff loc and take - loc can only slice the df but cant rearrange it.
#** if we want to pick rows / columns of our own order then use take
#** df[[4,2,1]] is similar to take, but negitive slicing not posiable

                    4         2         1
sale  city
sale1 city1  0.931271  1.690995  0.607809
      city2  0.869431 -0.461052 -1.116930
sale2 city1  0.318142 -0.224485 -0.867346
      city2 -1.166355 -0.550075  0.554530
sale3 city1 -0.791649  0.419472  1.232789
      city2  1.032973 -2.510629 -0.236061
sale4 city1 -0.333183  0.104505  1.176823
      city2  0.619749 -0.444269  1.639670

In [50]:
#sol-2
df[[4,2,1]]

                    4         2         1
sale  city
sale1 city1  0.931271  1.690995  0.607809
      city2  0.869431 -0.461052 -1.116930
sale2 city1  0.318142 -0.224485 -0.867346
      city2 -1.166355 -0.550075  0.554530
sale3 city1 -0.791649  0.419472  1.232789
      city2  1.032973 -2.510629 -0.236061
sale4 city1 -0.333183  0.104505  1.176823
      city2  0.619749 -0.444269  1.639670

Q18. Write a Pandas program to get the index of an element 11 of a given Series.

In [52]:
ds = pd.Series([1,3,5,7,9,11,13,15], index=[0,1,2,3,4,5,7,8])
ds

0     1
1     3
2     5
3     7
4     9
5    11
7    13
8    15
dtype: int64

In [55]:
ds[ds == 11].index

Int64Index([5], dtype='int64')

In [54]:
ds[ds == 11].index[0]

5

Q19.1 Write a Pandas program to select a specific row 3rd row of above series by integer index.

In [47]:
ds.iloc[[2]]

2    5
dtype: int64

Q19.2 Write a Pandas program to select a specific row 3rd row of above dataframe by integer index.

In [48]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32]})
df

  school_code class            name date_of_birth  weight
0        s001     V  Alberto Franco    15/05/2002      35
1        s002     V    Gino Mcneill    17/05/2002      32
2        s003    VI     Ryan Parkes    16/02/1999      33
3        s001    VI    Eesha Hinton    25/09/1998      30
4        s002     V    Gino Mcneill    11/05/2002      31
5        s004    VI    David Parkes    15/09/1997      32

In [49]:
df.iloc[[2]]

  school_code class         name date_of_birth  weight
2        s003    VI  Ryan Parkes    16/02/1999      33

Q20. Write a Pandas program to find the indexes of rows of a specified value(school_code=s001) of a given column in a DataFrame.

In [50]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32]},
     index =  [1, 2, 3, 4, 5, 6])
df

  school_code class            name date_of_birth  weight
1        s001     V  Alberto Franco    15/05/2002      35
2        s002     V    Gino Mcneill    17/05/2002      32
3        s003    VI     Ryan Parkes    16/02/1999      33
4        s001    VI    Eesha Hinton    25/09/1998      30
5        s002     V    Gino Mcneill    11/05/2002      31
6        s004    VI    David Parkes    15/09/1997      32

In [51]:
df.index[df['school_code']=='s001'].tolist() #** conditional indexing is possiable

[1, 4]

Q21. Write a Pandas program 

  a. to drop a index level 0 from a multi-level column index of a dataframe.
  
  b. to drop a index level 1 from a multi-level column index of a dataframe.

Note: Levels are 0-indexed beginning from the top.

In [52]:
cols = pd.MultiIndex.from_tuples([("a", "x"), ("a", "y"), ("a", "z")])
df = pd.DataFrame([[1,2,3], [3,4,5], [5,6,7]], columns=cols)
df

   a
   x  y  z
0  1  2  3
1  3  4  5
2  5  6  7

In [53]:
# to drop a index level 0
df.columns=df.columns.droplevel(0)
df

   x  y  z
0  1  2  3
1  3  4  5
2  5  6  7

In [54]:
# to drop a index level 1
cols = pd.MultiIndex.from_tuples([("a", "x"), ("a", "y"), ("a", "z")])
df = pd.DataFrame([[1,2,3], [3,4,5], [5,6,7]], columns=cols)

df.columns=df.columns.droplevel(1)
df

   a  a  a
0  1  2  3
1  3  4  5
2  5  6  7

Q22. Write a Pandas program to insert a column at a specific index 3 in a given DataFrame.

In [55]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'weight': [35, 32, 33, 30, 31, 32]},
     index =  [1, 2, 3, 4, 5, 6])
df

  school_code class            name  weight
1        s001     V  Alberto Franco      35
2        s002     V    Gino Mcneill      32
3        s003    VI     Ryan Parkes      33
4        s001    VI    Eesha Hinton      30
5        s002     V    Gino Mcneill      31
6        s004    VI    David Parkes      32

In [56]:
# new column
date_of_birth = ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997']
df.insert(loc=3, column='date_of_birth', value=date_of_birth)
df

  school_code class            name date_of_birth  weight
1        s001     V  Alberto Franco    15/05/2002      35
2        s002     V    Gino Mcneill    17/05/2002      32
3        s003    VI     Ryan Parkes    16/02/1999      33
4        s001    VI    Eesha Hinton    25/09/1998      30
5        s002     V    Gino Mcneill    11/05/2002      31
6        s004    VI    David Parkes    15/09/1997      32

Q23. Write a Pandas program to print above DataFrame without index.

In [57]:
print(df.to_string(index=False))

school_code class            name date_of_birth  weight
       s001     V  Alberto Franco    15/05/2002      35
       s002     V    Gino Mcneill    17/05/2002      32
       s003    VI     Ryan Parkes    16/02/1999      33
       s001    VI    Eesha Hinton    25/09/1998      30
       s002     V    Gino Mcneill    11/05/2002      31
       s004    VI    David Parkes    15/09/1997      32

Q24. Write a Pandas program to find integer index of rows with missing data in weight column of a given dataframe.

In [57]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, None, 33, 30, 31, None]},
     index = ['t1', 't2', 't3', 't4', 't5', 't6'])
df

   school_code class            name date_of_birth  weight
t1        s001     V  Alberto Franco    15/05/2002    35.0
t2        s002     V    Gino Mcneill    17/05/2002     NaN
t3        s003    VI     Ryan Parkes    16/02/1999    33.0
t4        s001    VI    Eesha Hinton    25/09/1998    30.0
t5        s002     V    Gino Mcneill    11/05/2002    31.0
t6        s004    VI    David Parkes    15/09/1997     NaN

In [58]:
l = df.index[df['weight'].apply(np.isnan)].values.tolist() # Conditional indexing to fetch index of nan values in weight column
l

['t2', 't6']

In [60]:
[df.index.get_loc(i) for i in l] # Integer index of rows with missing data in 'weight' column

[1, 5]

Q25. Write a Pandas program to start index with different value rather than 0 in a above DataFrame.

In [61]:
df.reset_index(drop=True, inplace=True)
df

  school_code class            name date_of_birth  weight
0        s001     V  Alberto Franco    15/05/2002    35.0
1        s002     V    Gino Mcneill    17/05/2002     NaN
2        s003    VI     Ryan Parkes    16/02/1999    33.0
3        s001    VI    Eesha Hinton    25/09/1998    30.0
4        s002     V    Gino Mcneill    11/05/2002    31.0
5        s004    VI    David Parkes    15/09/1997     NaN

In [62]:
df.index += 10

In [63]:
df

   school_code class            name date_of_birth  weight
10        s001     V  Alberto Franco    15/05/2002    35.0
11        s002     V    Gino Mcneill    17/05/2002     NaN
12        s003    VI     Ryan Parkes    16/02/1999    33.0
13        s001    VI    Eesha Hinton    25/09/1998    30.0
14        s002     V    Gino Mcneill    11/05/2002    31.0
15        s004    VI    David Parkes    15/09/1997     NaN

Q26. Write a Pandas program to select rows by filtering the value t2 in index tcode of multi-index dataframe.

In [60]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 37, 33, 30, 31, 32],
    'tcode': ['t1', 't2', 't3', 't4', 't5', 't6']})  
df = df.set_index(['tcode', 'school_code'])
df

                  class            name date_of_birth  weight
tcode school_code
t1    s001            V  Alberto Franco    15/05/2002      35
t2    s002            V    Gino Mcneill    17/05/2002      37
t3    s003           VI     Ryan Parkes    16/02/1999      33
t4    s001           VI    Eesha Hinton    25/09/1998      30
t5    s002            V    Gino Mcneill    11/05/2002      31
t6    s004           VI    David Parkes    15/09/1997      32

In [61]:
# Sol-1
df.query("tcode == 't2'")

                  class          name date_of_birth  weight
tcode school_code
t2    s002            V  Gino Mcneill    17/05/2002      37

In [75]:
# Sol-2
df.loc[('t2', 's002'),:]

class                       V
name             Gino Mcneill
date_of_birth      17/05/2002
weight                     37
Name: (t2, s002), dtype: object